EDT/КассовыйСервер/src/Documents/ксЗакрытиеСменыККМ/ксЗакрытиеСменыККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ксЗакрытиеСменыККМ</name>
  <registerRecords>InformationRegister.ксСостояниеСменККМ</registerRecords>
  <attributes>
    <name>ККМ</name>
    <type>
      <types>CatalogRef.ксКассыККМ</types>
    </type>
  </attributes>
  <attributes>
    <name>СменаЗакрытаЧерезWEBСервис</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

EDT/КассовыйСервер/src/InformationRegisters/ксСостояниеСменККМ/ксСостояниеСменККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ксСостояниеСменККМ</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СостояниеСмены</name>
    <type>
      <types>EnumRef.ксСостояниеСменККМ</types>
    </type>
  </resources>
  <dimensions>
    <name>ККМ</name>
    <type>
      <types>CatalogRef.ксКассыККМ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Кассир</name>
    <type>
      <types>CatalogRef.ксКассиры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/КассовыйСервер/src/Enums/ксСостояниеСменККМ/ксСостояниеСменККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ксСостояниеСменККМ</name>
  <enumValues>
    <name>СменаОткрыта</name>
  </enumValues>
  <enumValues>
    <name>СменаЗакрыта</name>
  </enumValues>
</mdclass:Enum>

EDT/КассовыйСервер/src/Documents/ксЗакрытиеСменыККМ/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ксСостояниеСменККМ
	Движения.ксСостояниеСменККМ.Записывать = Истина;
	Движение = Движения.ксСостояниеСменККМ.Добавить();
	Движение.Период = Дата;
	Движение.ККМ = ККМ;
	Движение.СостояниеСмены = Перечисления.ксСостояниеСменККМ.СменаЗакрыта;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
